particle-iot/device-os/hal/src/nRF52840/i2c_hal.cpp
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include <string.h>
#include "nrfx_twim.h"
#include "nrfx_twis.h"
#include "nrf_gpio.h"
#include "i2c_hal.h"
#include "gpio_hal.h"
#include "delay_hal.h"
#include "platforms.h"
#include "concurrent_hal.h"
#include "interrupts_hal.h"
#include "pinmap_impl.h"
#include "logging.h"
#include "system_error.h"
#include "system_tick_hal.h"
#include "timer_hal.h"
#include <memory>
#include "check.h"
#include <malloc.h>

#if PLATFORM_ID == PLATFORM_TRACKER
#include "usart_hal.h"
#endif

#define I2C_IRQ_PRIORITY            APP_IRQ_PRIORITY_LOWEST

#define WAIT_TIMED(timeout_ms, what) ({ \
    system_tick_t _micros = HAL_Timer_Get_Micro_Seconds();                      \
    bool res = true;                                                            \
    while ((what)) {                                                            \
        system_tick_t dt = (HAL_Timer_Get_Micro_Seconds() - _micros);           \
        bool nok = (((timeout_ms * 1000) < dt) && (what));                      \
        if (nok) {                                                              \
            res = false;                                                        \
            break;                                                              \
        }                                                                       \
    }                                                                           \
    res;                                                                        \
})

// [219] TWIM: I2C timing spec is violated at 400 kHz
const nrf_twim_frequency_t NRF_TWIM_FREQ_390K = (nrf_twim_frequency_t)(0x06200000UL);

#define CEIL_DIV(A, B)      (((A) + (B) - 1) / (B))

// Calculate TWIM frequency register value
#define CALC_TWIM_FREQ_HZ(freq_hz) \
    (CEIL_DIV(((uint64_t)(freq_hz) << 32) / 16000000UL, 4096UL) << 12)


class I2cLock {
public:
    I2cLock() = delete;

    I2cLock(hal_i2c_interface_t i2c)
            : i2c_(i2c) {
        hal_i2c_lock(i2c, nullptr);
    }

    ~I2cLock() {
        hal_i2c_unlock(i2c_, nullptr);
    }

private:
    hal_i2c_interface_t i2c_;
};

/* TWI instance. */
static nrfx_twim_t m_twim0 = NRFX_TWIM_INSTANCE(0);
static nrfx_twim_t m_twim1 = NRFX_TWIM_INSTANCE(1);
static nrfx_twis_t m_twis0 = NRFX_TWIS_INSTANCE(0);
static nrfx_twis_t m_twis1 = NRFX_TWIS_INSTANCE(1);

typedef enum transfer_state_t {
    TRANSFER_STATE_IDLE,
    TRANSFER_STATE_BUSY,
    TRANSFER_STATE_ERROR_ADDRESS,
    TRANSFER_STATE_ERROR_DATA
} transfer_state_t;

typedef struct nrf5x_i2c_info_t {
    nrfx_twim_t                 *master;
    nrfx_twis_t                 *slave;
    nrfx_twis_event_handler_t   callback_twis;
    uint8_t                     scl_pin;
    uint8_t                     sda_pin;

    volatile hal_i2c_state_t    state;
    volatile transfer_state_t   transfer_state;
    hal_i2c_mode_t              mode;
    uint32_t                    speed;

    uint8_t                     address;    // 7bit data

    uint8_t*                    rx_buf;
    size_t                      rx_buf_size;
    size_t                      rx_index_head;
    size_t                      rx_index_tail;
    uint8_t*                    tx_buf;
    size_t                      tx_buf_size;
    size_t                      tx_index_head;
    size_t                      tx_index_tail;

    os_mutex_recursive_t        mutex;
    bool                        configured;
    bool                        heap_buffer;

    void (*callback_on_request)(void);
    void (*callback_on_receive)(int);

    hal_i2c_transmission_config_t transfer_config;
} nrf5x_i2c_info_t;

static void twis0Handler(nrfx_twis_evt_t const * p_event);
static void twis1Handler(nrfx_twis_evt_t const * p_event);

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-field-initializers"
nrf5x_i2c_info_t i2cMap[HAL_PLATFORM_I2C_NUM] = {
    {&m_twim0, &m_twis0, twis0Handler, SCL, SDA}
#if PLATFORM_ID == PLATFORM_BORON || PLATFORM_ID == PLATFORM_TRACKER || PLATFORM_ID == PLATFORM_ESOMX || PLATFORM_ID == PLATFORM_ELECTRON2
   ,{&m_twim1, &m_twis1, twis1Handler, PMIC_SCL, PMIC_SDA}
#else
   ,{&m_twim1, &m_twis1, twis1Handler, D3, D2}
#endif // PLATFORM_ID == PLATFORM_BORON || PLATFORM_ID == PLATFORM_TRACKER || PLATFORM_ID == PLATFORM_ESOMX || PLATFORM_ID == PLATFORM_ELECTRON2
#if PLATFORM_ID == PLATFORM_TRACKER
   ,{&m_twim0, &m_twis0, twis0Handler, D8, D9}, // Shared with UART TX/RX
#endif // PLATFORM_ID == PLATFORM_TRACKER
};
#pragma GCC diagnostic pop

static void setConfigOrDefault(hal_i2c_interface_t i2c, const hal_i2c_transmission_config_t* config) {
    memset(&i2cMap[i2c].transfer_config, 0, sizeof(i2cMap[i2c].transfer_config));
    if (config) {
        memcpy(&i2cMap[i2c].transfer_config, config, std::min((size_t)config->size, sizeof(i2cMap[i2c].transfer_config)));
    } else {
        i2cMap[i2c].transfer_config = {
            .size = sizeof(hal_i2c_transmission_config_t),
            .version = 0,
            .address = 0xff,
            .reserved = {0},
            .quantity = 0,
            .timeout_ms = HAL_I2C_DEFAULT_TIMEOUT_MS,
            .flags = HAL_I2C_TRANSMISSION_FLAG_STOP,
            .buffer = nullptr
        };
    }
}

static void twisHandler(hal_i2c_interface_t i2c, nrfx_twis_evt_t const * p_event) {
    switch (p_event->type) {
        case NRFX_TWIS_EVT_READ_REQ: {
            i2cMap[i2c].callback_on_request();
            if (p_event->data.buf_req) {
                nrfx_twis_tx_prepare(i2cMap[i2c].slave, (void *)i2cMap[i2c].tx_buf, i2cMap[i2c].tx_index_tail);
            }
            break;
        }
        case NRFX_TWIS_EVT_READ_DONE: {
            i2cMap[i2c].tx_index_tail = i2cMap[i2c].tx_index_head = 0;
            break;
        }
        case NRFX_TWIS_EVT_WRITE_REQ: {
            i2cMap[i2c].rx_index_head = i2cMap[i2c].rx_index_tail = 0;
            if (p_event->data.buf_req) {
                nrfx_twis_rx_prepare(i2cMap[i2c].slave, (void *)i2cMap[i2c].rx_buf, i2cMap[i2c].rx_buf_size);
            }
            break;
        }
        case NRFX_TWIS_EVT_WRITE_DONE: {
            i2cMap[i2c].rx_index_head = 0;
            i2cMap[i2c].rx_index_tail = p_event->data.rx_amount;
            i2cMap[i2c].callback_on_receive(p_event->data.rx_amount);
            break;
        }
        case NRFX_TWIS_EVT_READ_ERROR:
        case NRFX_TWIS_EVT_WRITE_ERROR:
        case NRFX_TWIS_EVT_GENERAL_ERROR: {
            LOG_DEBUG(TRACE, "TWIS ERROR");
            i2cMap[i2c].tx_index_tail = i2cMap[i2c].tx_index_head = 0;
            i2cMap[i2c].rx_index_head = i2cMap[i2c].rx_index_tail = 0;
            break;
        }
        default: {
            break;
        }
    }
}

static void twis0Handler(nrfx_twis_evt_t const * p_event) {
    twisHandler(HAL_I2C_INTERFACE1, p_event);
}

