particle-iot/device-os/hal/src/nRF52840/i2c_hal.cpp
static void twis1Handler(nrfx_twis_evt_t const * p_event) {
    twisHandler(HAL_I2C_INTERFACE2, p_event);
}

static void twimHandler(nrfx_twim_evt_t const * p_event, void * p_context) {
    uint32_t interface = (uint32_t)p_context;
    switch (p_event->type) {
        case NRFX_TWIM_EVT_DONE: {
            // LOG_DEBUG(TRACE, "NRFX_TWIM_EVT_DONE");
            i2cMap[interface].transfer_state = TRANSFER_STATE_IDLE;
            break;
        }
        case NRFX_TWIM_EVT_ADDRESS_NACK: {
            LOG_DEBUG(TRACE, "NRFX_TWIM_EVT_ADDRESS_NACK");
            i2cMap[interface].transfer_state = TRANSFER_STATE_ERROR_ADDRESS;
            break;
        }
        case NRFX_TWIM_EVT_DATA_NACK: {
            LOG_DEBUG(TRACE, "NRFX_TWIM_EVT_DATA_NACK");
            i2cMap[interface].transfer_state = TRANSFER_STATE_ERROR_DATA;
            break;
        }
        default: {
            break;
        }
    }
}

static int twiUninit(hal_i2c_interface_t i2c, bool reset_pin_configuration = true) {
    if (i2cMap[i2c].state != HAL_I2C_STATE_ENABLED) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    if (i2cMap[i2c].mode == I2C_MODE_MASTER) {
        nrfx_twim_uninit(i2cMap[i2c].master);
    } else {
        nrfx_twis_uninit(i2cMap[i2c].slave);
    }

    if (reset_pin_configuration) {
        // Reset pin function
        hal_gpio_mode(i2cMap[i2c].scl_pin, PIN_MODE_NONE);
        hal_gpio_mode(i2cMap[i2c].sda_pin, PIN_MODE_NONE);
        hal_pin_set_function(i2cMap[i2c].scl_pin, PF_NONE);
        hal_pin_set_function(i2cMap[i2c].sda_pin, PF_NONE);
    }

    return SYSTEM_ERROR_NONE;
}

static int twiInit(hal_i2c_interface_t i2c) {
    ret_code_t ret;

    nrf_twim_frequency_t nrfFrequency = NRF_TWIM_FREQ_100K;
    if (i2cMap[i2c].speed == CLOCK_SPEED_400KHZ) {
        // NOTE:
        // [219] TWIM: I2C timing spec is violated at 400 kHz
        // If communication does not work at 400 kHz with an I2C compatible device
        // that requires the SCL clock to have a minimum low period of 1.3 µs,
        // use 390 kHz instead of 400kHz by writing 0x06200000 to the FREQUENCY register.
        // With this setting, the SCL low period is greater than 1.3 µs.
        nrfFrequency = NRF_TWIM_FREQ_390K;
    } else if (i2cMap[i2c].speed < CLOCK_SPEED_100KHZ && i2cMap[i2c].speed >= CLOCK_SPEED_10KHZ) {
        nrfFrequency = (nrf_twim_frequency_t)CALC_TWIM_FREQ_HZ(i2cMap[i2c].speed);
    }

    hal_pin_info_t* PIN_MAP = hal_pin_map();

    if (i2cMap[i2c].mode == I2C_MODE_MASTER) {
        const nrfx_twim_config_t twi_config = {
            .scl                = (uint32_t)NRF_GPIO_PIN_MAP(PIN_MAP[i2cMap[i2c].scl_pin].gpio_port, PIN_MAP[i2cMap[i2c].scl_pin].gpio_pin),
            .sda                = (uint32_t)NRF_GPIO_PIN_MAP(PIN_MAP[i2cMap[i2c].sda_pin].gpio_port, PIN_MAP[i2cMap[i2c].sda_pin].gpio_pin),
            .frequency          = nrfFrequency,
            .interrupt_priority = I2C_IRQ_PRIORITY,
            // Important! We need to keep the pins from floating when calling nrfx_twim_uninit under some error conditions
            .hold_bus_uninit    = true
        };

        void *p_context = (void *)i2c;
        ret = nrfx_twim_init(i2cMap[i2c].master, &twi_config, twimHandler, p_context);
        SPARK_ASSERT(ret == NRF_SUCCESS);

        nrfx_twim_enable(i2cMap[i2c].master);
    } else {
        const nrfx_twis_config_t twi_config = {
            .addr               = {i2cMap[i2c].address, 0},
            .scl                = (uint32_t)NRF_GPIO_PIN_MAP(PIN_MAP[i2cMap[i2c].scl_pin].gpio_port, PIN_MAP[i2cMap[i2c].scl_pin].gpio_pin),
            .sda                = (uint32_t)NRF_GPIO_PIN_MAP(PIN_MAP[i2cMap[i2c].sda_pin].gpio_port, PIN_MAP[i2cMap[i2c].sda_pin].gpio_pin),
            .scl_pull           = NRF_GPIO_PIN_NOPULL,
            .sda_pull           = NRF_GPIO_PIN_NOPULL,
            .interrupt_priority = I2C_IRQ_PRIORITY
        };

        ret = nrfx_twis_init(i2cMap[i2c].slave, &twi_config, i2cMap[i2c].callback_twis);
        SPARK_ASSERT(ret == NRF_SUCCESS);

        nrfx_twis_enable(i2cMap[i2c].slave);
    }

    // Set pin function
    hal_pin_set_function(i2cMap[i2c].scl_pin, PF_I2C);
    hal_pin_set_function(i2cMap[i2c].sda_pin, PF_I2C);

    return SYSTEM_ERROR_NONE;
}

static bool isConfigValid(const hal_i2c_config_t* config) {
    if ((config == nullptr) ||
            (config->rx_buffer == nullptr ||
             config->rx_buffer_size == 0 ||
             config->tx_buffer == nullptr ||
             config->tx_buffer_size == 0)) {
        return false;
    }
    return true;
}

int hal_i2c_init(hal_i2c_interface_t i2c, const hal_i2c_config_t* config) {
    CHECK_TRUE(i2c < HAL_PLATFORM_I2C_NUM, SYSTEM_ERROR_INVALID_ARGUMENT);
    // Disable threading to create the I2C mutex
    os_thread_scheduling(false, nullptr);
    if (i2cMap[i2c].mutex == nullptr) {
        os_mutex_recursive_create(&i2cMap[i2c].mutex);
    }

    // Re-enable threading and capture the mutex
    os_thread_scheduling(true, nullptr);
    I2cLock lk(i2c);

// sc-137389
#if HAL_PLATFORM_PMIC_BQ24195
    bool wasEnabled = false;
    if (i2cMap[i2c].state == HAL_I2C_STATE_ENABLED) {
        wasEnabled = true;
    }
#endif // HAL_PLATFORM_PMIC_BQ24195

    if (i2cMap[i2c].configured) {
        // Configured, but new buffers are invalid
        if (!isConfigValid(config)){
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        // Configured, but new buffers are smaller
        if (config->rx_buffer_size <= i2cMap[i2c].rx_buf_size ||
           config->tx_buffer_size <= i2cMap[i2c].tx_buf_size) {    
           return SYSTEM_ERROR_NOT_ENOUGH_DATA;
        }
        // Free current buffers if needed
        if (i2cMap[i2c].heap_buffer) {
            free(i2cMap[i2c].rx_buf);
            free(i2cMap[i2c].tx_buf); 
            i2cMap[i2c].configured = false;
        }
    }

    if (isConfigValid(config)) {
        i2cMap[i2c].rx_buf = config->rx_buffer;
        i2cMap[i2c].rx_buf_size = config->rx_buffer_size;
        i2cMap[i2c].tx_buf = config->tx_buffer;
        i2cMap[i2c].tx_buf_size = config->tx_buffer_size;
        i2cMap[i2c].heap_buffer = ((config->version >= HAL_I2C_CONFIG_VERSION_2) && (config->flags & HAL_I2C_CONFIG_FLAG_FREEABLE));
    } else {
        int buffer_size = HAL_PLATFORM_I2C_BUFFER_SIZE(i2c);
        // Allocate default buffers
        i2cMap[i2c].rx_buf = new (std::nothrow) uint8_t[buffer_size];
        i2cMap[i2c].rx_buf_size = buffer_size;
        i2cMap[i2c].tx_buf = new (std::nothrow) uint8_t[buffer_size];
        i2cMap[i2c].tx_buf_size = buffer_size;
        i2cMap[i2c].heap_buffer = true;

