particle-iot/device-os/hal/src/nRF52840/i2c_hal.cpp
        SPARK_ASSERT(i2cMap[i2c].rx_buf && i2cMap[i2c].tx_buf);
    }

    // Uninitialize I2C no matter in which state
    twiUninit(i2c);

    // Initialize I2C state
    i2cMap[i2c].state = HAL_I2C_STATE_DISABLED;
    i2cMap[i2c].mode = I2C_MODE_MASTER;
    i2cMap[i2c].transfer_state = TRANSFER_STATE_IDLE;
    i2cMap[i2c].speed = CLOCK_SPEED_100KHZ;
    i2cMap[i2c].rx_index_head = 0;
    i2cMap[i2c].rx_index_tail = 0;
    i2cMap[i2c].tx_index_head = 0;
    i2cMap[i2c].tx_index_tail = 0;
    i2cMap[i2c].configured = true;
    memset((void *)i2cMap[i2c].rx_buf, 0, i2cMap[i2c].rx_buf_size);
    memset((void *)i2cMap[i2c].tx_buf, 0, i2cMap[i2c].tx_buf_size);

// sc-137389
#if HAL_PLATFORM_PMIC_BQ24195
    if (i2c == HAL_PLATFORM_PMIC_BQ24195_I2C) {
        if (wasEnabled) {
            hal_i2c_begin(i2c, I2C_MODE_MASTER, 0x00, nullptr);
        }
    }
#endif // #if HAL_PLATFORM_PMIC_BQ24195

    return SYSTEM_ERROR_NONE;
}

void hal_i2c_set_speed(hal_i2c_interface_t i2c, uint32_t speed, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }

    I2cLock lk(i2c);
    i2cMap[i2c].speed = speed;
}

void hal_i2c_stretch_clock(hal_i2c_interface_t i2c, bool stretch, void* reserved) {
    // always enabled
}

void hal_i2c_begin(hal_i2c_interface_t i2c, hal_i2c_mode_t mode, uint8_t address, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }

    I2cLock lk(i2c);
#if PLATFORM_ID == PLATFORM_TRACKER
    /*
     * On Tracker both I2C_INTERFACE1 and I2C_INTERFACE3 use the same peripheral - m_twim0,
     * but on different pins. We cannot enable both of them at the same time.
     */
    if (i2c == HAL_I2C_INTERFACE1 || i2c == HAL_I2C_INTERFACE3) {
        hal_i2c_interface_t dependent = (i2c == HAL_I2C_INTERFACE1 ? HAL_I2C_INTERFACE3 : HAL_I2C_INTERFACE1);
        if (hal_i2c_is_enabled(dependent, nullptr)) {
            // Unfortunately we cannot return an error code here
            return;
        }
    }
    /*
     * On Tracker both I2C_INTERFACE3 and USART_SERIAL1 use the same pins - D8 and D9,
     * We cannot enable both of them at the same time.
     */
    if (i2c == HAL_I2C_INTERFACE3) {
        if (hal_usart_is_enabled(HAL_USART_SERIAL1)) {
            // Unfortunately we cannot return an error code here
            return;
        }
    }
#endif // PLATFORM_ID == PLATFORM_TRACKER

    if (twiUninit(i2c) == SYSTEM_ERROR_NONE) {
        i2cMap[i2c].state = HAL_I2C_STATE_DISABLED;
    }

    if (i2cMap[i2c].state == HAL_I2C_STATE_DISABLED) {
        i2cMap[i2c].rx_index_head = 0;
        i2cMap[i2c].rx_index_tail = 0;
        i2cMap[i2c].tx_index_head = 0;
        i2cMap[i2c].tx_index_tail = 0;
        memset((void *)i2cMap[i2c].rx_buf, 0, i2cMap[i2c].rx_buf_size);
        memset((void *)i2cMap[i2c].tx_buf, 0, i2cMap[i2c].tx_buf_size);
    }

    i2cMap[i2c].mode = mode;
    i2cMap[i2c].address = address;

    if (i2cMap[i2c].state != HAL_I2C_STATE_ENABLED && twiInit(i2c) == SYSTEM_ERROR_NONE) {
        i2cMap[i2c].state = HAL_I2C_STATE_ENABLED;
    }
}

void hal_i2c_end(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }

    I2cLock lk(i2c);
    if (hal_i2c_is_enabled(i2c, nullptr)) {
        if (twiUninit(i2c) == SYSTEM_ERROR_NONE) {
            i2cMap[i2c].state = HAL_I2C_STATE_DISABLED;
        }
    }
}

uint32_t hal_i2c_request(hal_i2c_interface_t i2c, uint8_t address, uint8_t quantity, uint8_t stop, void* reserved) {
    hal_i2c_transmission_config_t conf = {
        .size = sizeof(hal_i2c_transmission_config_t),
        .version = 0,
        .address = address,
        .reserved = {0},
        .quantity = quantity,
        .timeout_ms = HAL_I2C_DEFAULT_TIMEOUT_MS,
        .flags = (uint32_t)(stop ? HAL_I2C_TRANSMISSION_FLAG_STOP : 0),
        .buffer = nullptr
    };
    return hal_i2c_request_ex(i2c, &conf, nullptr);
}

int32_t hal_i2c_request_ex(hal_i2c_interface_t i2c, const hal_i2c_transmission_config_t* config, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM || !hal_i2c_is_enabled(i2c, nullptr)) {
        return 0;
    }

    I2cLock lk(i2c);
    size_t quantity = 0;

    if (!config) {
        goto ret;
    }

    quantity = config->quantity;

    // clamp to buffer length
    if (quantity > i2cMap[i2c].rx_buf_size) {
        quantity = i2cMap[i2c].rx_buf_size;
    }

    i2cMap[i2c].transfer_state = TRANSFER_STATE_BUSY;
    if (nrfx_twim_rx(i2cMap[i2c].master, config->address, (uint8_t *)i2cMap[i2c].rx_buf, quantity)) {
        // FIXME: There is a bug in nrfx_twim driver, if we call nrfx_twim_rx repeatedly and quickly,
        // p_cb->busy will be set and never cleared, in this case nrfx_twim_rx always returns busy error
        LOG_DEBUG(TRACE, "BUSY ERROR, restore twi.");
        hal_i2c_reset(i2c, 0, nullptr);
        quantity = 0;
        goto ret;
    }

    if (!WAIT_TIMED(config->timeout_ms, i2cMap[i2c].transfer_state == TRANSFER_STATE_BUSY)) {
        hal_i2c_reset(i2c, 0, nullptr);
        quantity = 0;
        goto ret;
    }

    if (i2cMap[i2c].transfer_state != TRANSFER_STATE_IDLE) {
        // Get into error state
        hal_i2c_reset(i2c, 0, nullptr);
        quantity = 0;
        goto ret;
    }

ret:
    i2cMap[i2c].transfer_state = TRANSFER_STATE_IDLE;
    i2cMap[i2c].rx_index_head = 0;
    i2cMap[i2c].rx_index_tail = quantity;
    return quantity;
}

void hal_i2c_begin_transmission(hal_i2c_interface_t i2c, uint8_t address, const hal_i2c_transmission_config_t* config) {
    if (i2c >= HAL_PLATFORM_I2C_NUM || !hal_i2c_is_enabled(i2c, nullptr)) {
        return;
    }

    I2cLock lk(i2c);
    i2cMap[i2c].address = address;
    i2cMap[i2c].tx_index_head = 0;
    i2cMap[i2c].tx_index_tail = 0;
    setConfigOrDefault(i2c, config);
}

uint8_t hal_i2c_end_transmission(hal_i2c_interface_t i2c, uint8_t stop, void* reserved) {
    return hal_i2c_compat_error_from(hal_i2c_end_transmission_ext(i2c, stop, reserved));
}

int hal_i2c_end_transmission_ext(hal_i2c_interface_t i2c, uint8_t stop, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    I2cLock lk(i2c);
    int ret_code = SYSTEM_ERROR_NONE;

    if (i2cMap[i2c].transfer_config.address != 0xff) {
        stop = i2cMap[i2c].transfer_config.flags & HAL_I2C_TRANSMISSION_FLAG_STOP;
    }

