particle-iot/device-os/hal/src/nRF52840/i2c_hal.cpp
    i2cMap[i2c].transfer_state = TRANSFER_STATE_BUSY;
    if (nrfx_twim_tx(i2cMap[i2c].master, i2cMap[i2c].address, (uint8_t *)i2cMap[i2c].tx_buf, i2cMap[i2c].tx_index_tail, !stop)) {
        hal_i2c_reset(i2c, 0, nullptr);
        ret_code = SYSTEM_ERROR_I2C_FILL_DATA_TIMEOUT;
        goto ret;
    }

    if (!WAIT_TIMED(i2cMap[i2c].transfer_config.timeout_ms, i2cMap[i2c].transfer_state == TRANSFER_STATE_BUSY)) {
        hal_i2c_reset(i2c, 0, nullptr);
        ret_code = SYSTEM_ERROR_I2C_TX_DATA_TIMEOUT;
        goto ret;
    }

    if (i2cMap[i2c].transfer_state != TRANSFER_STATE_IDLE) {
        hal_i2c_reset(i2c, 0, nullptr);
        ret_code = SYSTEM_ERROR_INTERNAL;
        goto ret;
    }

ret:
    i2cMap[i2c].transfer_state = TRANSFER_STATE_IDLE;
    i2cMap[i2c].tx_index_head = 0;
    i2cMap[i2c].tx_index_tail = 0;
    return ret_code;
}

uint32_t hal_i2c_write(hal_i2c_interface_t i2c, uint8_t data, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM || !hal_i2c_is_enabled(i2c, nullptr)) {
        return 0;
    }

    I2cLock lk(i2c);
    // in master/slave transmitter mode
    // don't bother if buffer is full
    if (i2cMap[i2c].tx_index_tail >= i2cMap[i2c].tx_buf_size) {
        return 0;
    }
    // put byte in tx buffer
    i2cMap[i2c].tx_buf[i2cMap[i2c].tx_index_head++] = data;
    // update amount in buffer
    i2cMap[i2c].tx_index_tail = i2cMap[i2c].tx_index_head;

    return 1;
}

int32_t hal_i2c_available(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return 0;
    }

    I2cLock lk(i2c);
    int32_t available = i2cMap[i2c].rx_index_tail - i2cMap[i2c].rx_index_head;
    return available;
}

int32_t hal_i2c_read(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return -1;
    }

    I2cLock lk(i2c);
    int value = -1;
    // get each successive byte on each call
    if (i2cMap[i2c].rx_index_head < i2cMap[i2c].rx_index_tail) {
        value = i2cMap[i2c].rx_buf[i2cMap[i2c].rx_index_head++];
    }
    return value;
}

int32_t hal_i2c_peek(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return -1;
    }

    I2cLock lk(i2c);
    int value = -1;
    if(i2cMap[i2c].rx_index_head < i2cMap[i2c].rx_index_tail) {
        value = i2cMap[i2c].rx_buf[i2cMap[i2c].rx_index_head];
    }
    return value;
}

void hal_i2c_flush(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }
    I2cLock lk(i2c);
    i2cMap[i2c].rx_index_head = 0;
    i2cMap[i2c].rx_index_tail = 0;
    i2cMap[i2c].tx_index_head = 0;
    i2cMap[i2c].tx_index_tail = 0;
}

bool hal_i2c_is_enabled(hal_i2c_interface_t i2c,void* reserved) {
    return i2cMap[i2c].state == HAL_I2C_STATE_ENABLED;
}

void hal_i2c_set_callback_on_received(hal_i2c_interface_t i2c, void (*function)(int),void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }

    I2cLock lk(i2c);
    i2cMap[i2c].callback_on_receive = function;
}

void hal_i2c_set_callback_on_requested(hal_i2c_interface_t i2c, void (*function)(void),void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return;
    }
    
    I2cLock lk(i2c);
    i2cMap[i2c].callback_on_request = function;
}

void hal_i2c_enable_dma_mode(hal_i2c_interface_t i2c, bool enable,void* reserved) {
    // use DMA to send data by default
}

int hal_i2c_reset(hal_i2c_interface_t i2c, uint32_t reserved, void* reserved1) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return SYSTEM_ERROR_NOT_FOUND;
    }

    I2cLock lk(i2c);
    if (!hal_i2c_is_enabled(i2c, nullptr) || (i2cMap[i2c].mode != I2C_MODE_MASTER)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    // Important: we keep GPIO configuration intact
    if (twiUninit(i2c, false) == SYSTEM_ERROR_NONE) {
        i2cMap[i2c].state = HAL_I2C_STATE_DISABLED;
    }

    // Just in case make sure that the pins are correctly configured (they should anyway be at this point)
    hal_gpio_config_t conf = {
        .size = sizeof(conf),
        .version = HAL_GPIO_VERSION,
        .mode = OUTPUT_OPEN_DRAIN_PULLUP,
        .set_value = true,
        .value = 1,
        .drive_strength = HAL_GPIO_DRIVE_DEFAULT
    };
    hal_gpio_configure(i2cMap[i2c].sda_pin, &conf, nullptr);
    conf.value = hal_gpio_read(i2cMap[i2c].scl_pin);
    hal_gpio_configure(i2cMap[i2c].scl_pin, &conf, nullptr);

    // Generate up to 9 pulses on SCL to tell slave to release the bus
    for (int i = 0; i < 9; i++) {
        hal_gpio_write(i2cMap[i2c].sda_pin, 1);
        HAL_Delay_Microseconds(50);

        if (hal_gpio_read(i2cMap[i2c].sda_pin) == 0) {
            hal_gpio_write(i2cMap[i2c].scl_pin, 0);
            HAL_Delay_Microseconds(50);
            hal_gpio_write(i2cMap[i2c].scl_pin, 1);
            HAL_Delay_Microseconds(50);
            hal_gpio_write(i2cMap[i2c].scl_pin, 0);
            HAL_Delay_Microseconds(50);
        } else {
            break;
        }
    }

    // Generate STOP condition: pull SDA low, switch to high
    hal_gpio_write(i2cMap[i2c].sda_pin, 0);
    HAL_Delay_Microseconds(50);
    hal_gpio_write(i2cMap[i2c].scl_pin, 1);
    HAL_Delay_Microseconds(50);
    hal_gpio_write(i2cMap[i2c].sda_pin, 1);
    HAL_Delay_Microseconds(50);

    hal_pin_set_function(i2cMap[i2c].sda_pin, PF_I2C);
    hal_pin_set_function(i2cMap[i2c].scl_pin, PF_I2C);

    hal_i2c_begin(i2c, i2cMap[i2c].mode, i2cMap[i2c].address, nullptr);
    CHECK_TRUE(hal_i2c_is_enabled(i2c, nullptr), SYSTEM_ERROR_INTERNAL);
    return SYSTEM_ERROR_NONE;
}

int32_t hal_i2c_lock(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return -1;
    }
    if (!hal_interrupt_is_isr()) {
        os_mutex_recursive_t mutex = i2cMap[i2c].mutex;
        if (mutex) {
            return os_mutex_recursive_lock(mutex);
        }
    }
    return -1;
}

int32_t hal_i2c_unlock(hal_i2c_interface_t i2c, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return -1;
    }
    if (!hal_interrupt_is_isr()) {
        os_mutex_recursive_t mutex = i2cMap[i2c].mutex;
        if (mutex) {
            return os_mutex_recursive_unlock(mutex);
        }
    }
    return -1;
}

int hal_i2c_sleep(hal_i2c_interface_t i2c, bool sleep, void* reserved) {
    if (i2c >= HAL_PLATFORM_I2C_NUM) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    I2cLock lk(i2c);
    if (sleep) {
        // Suspend I2C
        CHECK_TRUE(i2cMap[i2c].state == HAL_I2C_STATE_ENABLED, SYSTEM_ERROR_INVALID_STATE);
        hal_i2c_end(i2c, nullptr);
        i2cMap[i2c].state = HAL_I2C_STATE_SUSPENDED;
    } else {
        // Restore I2C
        CHECK_TRUE(i2cMap[i2c].state == HAL_I2C_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        hal_i2c_begin(i2c, i2cMap[i2c].mode, i2cMap[i2c].address, nullptr);
    }

    return SYSTEM_ERROR_NONE;
}

int hal_i2c_transaction(hal_i2c_interface_t i2c, const hal_i2c_transmission_config_t* tx_config, const hal_i2c_transmission_config_t* rx_config, void* reserved) {
    // TODO
    return SYSTEM_ERROR_NOT_SUPPORTED;
}
